Tekla Open API Reference for Tekla Structures 2025
SymbolInfo Constructor
 Creates a new symbol info instance.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public SymbolInfo()
Public Sub New
See Also
Reference
SymbolInfo Class
SymbolInfo Overload
Tekla.Structures.Drawing Namespace